Revit 2027 API
AnalysisResultSchema.GetUnitsName Method
 returns units name by index
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetUnitsName(
	int index
)
Public Function GetUnitsName (
	index As Integer
) As String
public:
String^ GetUnitsName(
	int index
)
member GetUnitsName :
        index : int -> string
Parameters
index Int32
 index of unit in the list
Return Value
String
See Also
Reference
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace